import telebot
import random

bot = telebot.TeleBot("")

fact = [
    "Одна пластиковая бутылка разлагается 450–500 лет.",
    "Стекло может разлагаться более 1000 лет.",
    "Каждый человек производит около 1 кг мусора в день.",
    "90% пластиковых отходов в океане — это одноразовая упаковка.",
    "Каждый переработанный алюминиевый баллон экономит 95% энергии по сравнению с производством нового.",
    "На производство одного кило бумаги уходит около 10 литров воды.",
    "Одна батарейка загрязняет до 20 м² почвы тяжёлыми металлами.",
    "50% мусора можно перерабатывать, но фактически перерабатывается намного меньше.",
    "Переработка одного стеклянного предмета экономит достаточно энергии, чтобы лампочка горела 4 часа.",
    "Только 9% всего произведённого пластика в мире когда-либо было переработано.",
    "Пластиковые пакеты используются в среднем 12 минут, но разлагаются десятки лет.",
    "Одна алюминиевая банка может быть переработана и оказаться на прилавке снова через 60 дней.",
    "Переработка 1 тонны бумаги спасает около 17 деревьев.",
    "Микропластик найден даже в питьевой воде и снежинках в Антарктиде.",
    "Комнатные растения могут заметно улучшать качество воздуха в помещении.",
    "Большинство пластиковых трубочек не перерабатываются и заканчивают на свалках или в океане.",
    "Если заменить одноразовую бутылку на многоразовую, можно сократить отходы на сотни бутылок в год.",
    "Переработка пластика экономит до 70% энергии, необходимой для производства нового.",
    "Картон разлагается быстрее большинства других материалов — около 2 месяцев.",
    "Экономия воды при закрытии крана во время чистки зубов — до 10 литров за раз."
]
plastic = [
    "🟦 ПЭТ (1)\n\n"
    "🔹 Что это: бутылки для воды, газировки, масла.\n"
    "🔹 Безопасность: безопасен при разовом использовании; не любит нагрев.\n"
    "🔹 Переработка: хорошо перерабатывается ♻️.",

    "🟩 HDPE (2)\n\n"
    "🔹 Что это: канистры, крышки, бытовая химия, пакеты.\n"
    "🔹 Безопасность: прочный, устойчивый, считается одним из самых безопасных.\n"
    "🔹 Переработка: отлично перерабатывается.",

    "🟥 PVC (3)\n\n"
    "🔹 Что это: дешёвые игрушки, плёнки, коврики, шланги.\n"
    "🔹 Безопасность: нежелателен; может выделять токсичные вещества.\n"
    "🔹 Переработка: перерабатывается плохо.",

    "🟨 LDPE (4)\n\n"
    "🔹 Что это: мягкие пакеты, обёртки, плёнки.\n"
    "🔹 Безопасность: гибкий и безопасный, но загрязняет природу.\n"
    "🔹 Переработка: принимается редко.",

    "🟧 PP (5)\n\n"
    "🔹 Что это: пищевые контейнеры, крышки, йогурты, трубочки.\n"
    "🔹 Безопасность: считается одним из самых безопасных пластиков; подходит для еды.\n"
    "🔹 Переработка: перерабатывается частично.",

    "🟥 PS (6)\n\n"
    "🔹 Что это: одноразовая посуда, лотки, стаканчики.\n"
    "🔹 Безопасность: токсичен при нагреве; не подходит для горячей пищи.\n"
    "🔹 Переработка: почти не перерабатывается.",

    "🟫 7 (Other)\n\n"
    "🔹 Что это: смешанный пластик, композиты, поликарбонат.\n"
    "🔹 Безопасность: состав непредсказуем, свойства сильно отличаются.\n"
    "🔹 Переработка: практически не перерабатывается."
]

myths = [
    {
        "myth": "Сортировать мусор бессмысленно, всё равно всё свозят на одну свалку.",
        "truth": "Во многих городах переработчики реально забирают вторсырьё отдельно. Чем чище фракция, тем выгоднее переработка и тем меньше идёт на полигон."
    },
    {
        "myth": "Пластиковая посуда безопасна полностью.",
        "truth": "Некоторые виды пластика (особенно одноразовая посуда) могут выделять вредные вещества даже при обычном использовании. Лучше выбирать многоразовую и проверять маркировку."
    },
    {
        "myth": "Бумага всегда экологичнее пластика.",
        "truth": "Производство бумаги тоже требует много воды и энергии. Важно не только из чего сделана упаковка, но и сколько раз её можно использовать и переработать."
    },
    {
        "myth": "Одна батарейка - это ерунда, можно выбросить с обычным мусором.",
        "truth": "Одна батарейка может загрязнить до 20 м² почвы тяжёлыми металлами. Их всегда нужно сдавать в специальные контейнеры."
    },
    {
        "myth": "Если я один что-то делаю для экологии - это ничего не меняет.",
        "truth": "Экопривычки одного человека масштабируются на семью, друзей и коллег. Так формируются массовые изменения и спрос на более экологичные решения."
    },
]

@bot.message_handler(commands=['myth'])
def send_myth(message):
    item = random.choice(myths)
    text = (
        f"Миф и опровержение!🌿 \n\n"
        f"*Миф*: {item['myth']}\n\n"
        f"*Правда*: {item['truth']}"
    )
    bot.send_message(message.chat.id, text, parse_mode='Markdown')

@bot.message_handler(commands=['plastic'])
def send_plastic(message):
    item = random.choice(plastic)
    text = (
        f"*♻️Что такое маркировка пластика?* \n\n"
        f"Пластик имеет свою «ДНК» — треугольник из трёх стрелок с цифрой от 1 до 7 внутри. Эта цифра — код материала, из которого сделана упаковка или изделие. \n\n"
        f"Каждый тип пластика имеет свои свойства, температуру плавления, токсичность и способы переработки. Именно поэтому все 7 видов сортируют и перерабатывают отдельно — иначе переработка просто не сработает. \n\n"
        f"Рандомная *маркировка пластика*:\n{item}"
    )
    bot.send_message(message.chat.id, text, parse_mode='Markdown')

@bot.message_handler(commands=['fact'])
def send_fact(message):
    item = random.choice(fact)
    text = (
        f"Вот рандомный факт про *окружающую среду*!🌼 \n\n"
        f"{item}"
    )
    bot.send_message(message.chat.id, text, parse_mode='Markdown')

bot.polling()
